Repository: pingfangx/TranslatorX-other
Catalog: Gradle/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Generally, a namespace that identifies ownership and a name are all that are needed for a good plugin id.
zh_cn: 通常，一个好的插件 id 只需要一个标识所有权名称空间和名字即可。

source: Generally, this JAR might include some plugins, or bundle several related task classes into a single library.
zh_cn: 通常，这个 JAR 可能包含一些插件，或者将几个相关的任务类打包到一个库中。

source: Getting Started
zh_cn: 入门

source: Gradle & Third-party Tools
zh_cn: Gradle 和第三方工具

source: Gradle Enterprise
zh_cn: Gradle 企业

source: Gradle adds a configuration block for each extension object, so you can group settings together.
zh_cn: Gradle 为每个扩展对象添加了一个配置块，因此你可以将设置分组在一起。

source: Gradle allows you to implement your own plugins, so you can reuse your build logic, and share it with others.
zh_cn: Gradle 允许你实现自己的插件，这样就可以重用构建逻辑，并与其他人共享。

source: Gradle at its core intentionally provides very little for real world automation.
zh_cn: Gradle 的核心为实际的自动化仅提供了很少的功能。

source: Gradle has a vibrant community of plugin developers who contribute plugins for a wide variety of capabilities.
zh_cn: Gradle 有一个充满活力的插件开发者社区，他们为各种各样的功能提供插件。

source: Gradle on CI
zh_cn: CI 上的 Gradle

source: Gradle provides a number of features that are helpful when developing Gradle types, including plugins.
zh_cn: Gradle 提供了许多有用的功能，在开发 Gradle 类型时有用，包括插件。

source: Gradle provides some types that you can use in task implementations and extensions to help you with this.
zh_cn: Gradle 提供了一些类型，你可以在任务实现和扩展中使用这些类型来帮助你实现这一点。

source: Gradle provides the core plugins (e.g. JavaPlugin) as part of its distribution which means they are automatically resolved.
zh_cn: Gradle 提供核心插件(例如，JavaPlugin)作为其分发的一部分，这意味着它们会自动解析。

source: Gradle recommends that you place sources in directories according to their language, because builds are more performant and both the user and build can make stronger assumptions.
zh_cn: Gradle 建议你根据源代码的语言将其放在相应目录中，这样构建的性能更高，用户和构建都可以做出更有力的假设。

source: Gradle tries to locate a settings.gradle (Groovy DSL) or a settings.gradle.kts (Kotlin DSL) file with every invocation of the build.
zh_cn: Gradle 的每次构建调用都会尝试寻找 settings.gradle(Groovy DSL)或 settings.gradle.kts(Kotlin DSL)文件。

source: Gradle will take care of compiling and testing the plugin and making it available on the classpath of the build script.
zh_cn: Gradle 将负责编译和测试插件，并使其在构建脚本的类路径上可用。

source: Gradle-managed Directories
zh_cn: Gradle 管理的目录

source: Gradle’s language plugins establish conventions for discovering and compiling source code.
zh_cn: Gradle 的语言插件建立了查找和编译源代码的规范。

source: Gradle’s recommended way of organizing build logic is to use its plugin system.
zh_cn: Gradle 推荐的组织构建逻辑的方法是使用其插件系统。

source: Groovy DSL precompiled script plugins are available starting with Gradle 6.4.
zh_cn: Groovy DSL 预编译脚本插件从 Gradle 6.4 开始可用。

source: Groovy DSL precompiled script plugins can be applied in projects that use Gradle 5.0 and later.
zh_cn: Groovy DSL 预编译脚本插件可以应用于使用 Gradle 5.0 及更高版本的项目中。

source: Groovy Plugin
zh_cn: Groovy 插件

source: Handling Changing Versions
zh_cn: 处理变更中版本

source: Handling Mutually Exclusive Dependencies
zh_cn: 处理互斥依赖

source: Have a look at the sample that demonstrates a multi-project build that models the build logic using convention plugins.
zh_cn: 看一下 示例，其演示了一个多项目使用约定插件管理构建逻辑。

source: Have a look at the sample that demonstrates how a separate integration tests configuration can be added to a Java-based project.
zh_cn: 可以看下 例子，它演示了如何将单独的集成测试配置添加到基于 Java 的项目中。

source: Here is a simple build script for the project.
zh_cn: 下面是该项目的一个简单构建脚本。

source: Here we add a greeting extension object to the project, which allows you to configure the greeting.
zh_cn: 在这里，我们向项目添加了一个 greeting 扩展对象，它允许你配置问候语。

source: However, it is not visible outside the build, and so you cannot reuse the plugin outside the build it is defined in.
zh_cn: 但是，它在构建外部不可见，因此不能在定义插件的构建外部重用插件。

source: However, non-core binary plugins need to be resolved before they can be applied.
zh_cn: 然而，在应用非核心二进制插件之前，需要对其进行解析。

source: However, the plugin is not visible outside the build script, and so you cannot reuse the plugin outside the build script it is defined in.
zh_cn: 但是，插件在构建脚本之外是不可见的，因此不能在定义插件的构建脚本之外重用插件。

source: If the restrictions of the plugins {} block are prohibitive, the recommended approach is to apply plugins using the buildscript {} block.
zh_cn: 如果 plugins {} 块的限制是禁止的，建议使用 buildscript {} 块 应用插件。

source: If you are interested in publishing your plugin to be used by the wider Gradle community, you can publish it to the Gradle Plugin Portal.
zh_cn: 如果你有兴趣发布你的插件供更广泛的 Gradle 社区使用，你可以将其发布到 Gradle Plugin Portal。

source: If you are publishing your plugin internally for use within your organization, you can publish it like any other code artifact.
zh_cn: 如果你在内部发布插件以供组织内部使用，则可以像其他任何代码库一样发布它。

source: If you don’t want the Gradle Plugin Portal to be searched, omit the gradlePluginPortal() line.
zh_cn: 如果不想搜索 Gradle Plugin Portal，可以省略 gradlePluginPortal() 这一行。

source: If you have a multi-project build, you probably want to apply plugins to some or all of the subprojects in your build, but not to the root project.
zh_cn: 如果你有一个 多项目构建，那么你可能希望将插件应用于构建中的部分或所有子项目，而不是应用于 根 项目。

source: If your plugin was published without using the Java Gradle Plugin Development Plugin, the publication will be lacking Plugin Marker Artifact, which is needed for plugins DSL to locate the plugin.
zh_cn: 如果你的插件发布时没有使用 Java Gradle Plugin Development Plugin，那么发布产物将缺少 Plugin Marker Artifact，这是 plugins DSL 定位插件所需要的。

source: Implement logic for downloading and repackaging a Gradle distribution.
zh_cn: 实现下载和重新打包 Gradle 分发的逻辑。

source: Implementing Plugins
zh_cn: 实现插件

source: Improving Performance of Gradle Builds
zh_cn: 提高 Gradle 构建的性能

source: In Gradle, properties can be defined in the build script, in a gradle.properties file or as parameters on the command line.
zh_cn: 在 Gradle 中，属性可以在构建脚本中、gradle.properties 文件中或作为命令行上的参数声明。

source: In addition to plugins written as standalone projects, Gradle also allows you to provide build logic written in either Groovy or Kotlin DSLs as precompiled script plugins.
zh_cn: 除了作为独立项目编写的插件外，Gradle 还允许你提供以 Groovy 或 Kotlin DSL 编写的构建逻辑作为预编译脚本插件。

source: In fact, Gradle core plugins are modeled in the same way - for example, the Java Plugin configures a generic java project, while Java Library Plugin internally applies the Java Plugin and configures aspects specific to a Java library in addition.
zh_cn: 实际上，Gradle 核心插件 是以同样的方式建模的 - 例如，Java Plugin 配置一个通用的 java 项目，而 Java Library Plugin 在内部应用 Java Plugin，并配置特定于 Java 库的方面。

source: In fact, the plugin metadata for them is generated using the Gradle Plugin Development Plugin.
zh_cn: 实际上，它们的插件元数据是使用 Gradle Plugin Development Plugin 生成的。

source: In general, a plugin implemented using Java or Kotlin, which are statically typed, will perform better than the same plugin implemented using Groovy.
zh_cn: 一般来说，使用静态类型的 Java 或 Kotlin 语言实现的插件，比使用 Groovy 实现的插件性能更好。

source: In order for precompiled script plugins to be discovered, the buildSrc project needs to apply the groovy-gradle-plugin plugin in its build.gradle file:
zh_cn: 为了可以发现预编译脚本插件，buildSrc 项目需要在其 build.gradle 文件中应用 groovy-gradle-plugin 插件：

source: In order for precompiled script plugins to be discovered, the buildSrc project needs to apply the kotlin-dsl plugin in its build.gradle.kts file:
zh_cn: 为了可以发现预编译脚本插件，buildSrc 项目需要在其 build.gradle.kts 文件中应用 kotlin-dsl 插件：

source: In order to apply an external plugin in a precompiled script plugin, it has to be added to the plugin project’s implementation classpath in the plugin’s build file.
zh_cn: 为了在预编译脚本插件中应用外部插件，必须将外部插件添加到插件的构建文件中的插件项目的 implementation 类路径中。

source: In our examples, we are going to use Java as the implementation language for standalone plugin project and Groovy or Kotlin in the buildscript plugin examples.
zh_cn: 在我们的示例中，我们将使用 Java 作为独立插件项目的实现语言，在 buildscript 插件示例中使用 Groovy 或 Kotlin。

source: In our examples, we will start with the plugin in the build script, to keep things simple.
zh_cn: 在我们的示例中，我们将从构建脚本中的插件开始，以保持简单。

source: In the above case, we are using the short name ‘java’ to apply the JavaPlugin.
zh_cn: 在上面的例子中，我们使用短名称“java”来应用 JavaPlugin。

source: In the long run, cross configuration usually grows complex with more and more conditional logic and a higher maintenance burden.
zh_cn: 从长远来看，跨项目配置通常会变得越来越复杂，有越来越多的条件逻辑和更高的维护成本。

source: In this case we want to apply a common set of rules to all of them, such as source directory layout, compiler flags, code style conventions, code quality checks and so on.
zh_cn: 在这种情况下，我们希望将一组公共规则应用于所有这些项目，例如源目录布局、编译器标志、代码样式规范、代码质量检查等等。

source: In this case, the recommended way to resolve the plugin in another project is to add a resolutionStrategy section to the pluginManagement {} block of the project’s settings file as shown below.
zh_cn: 在这种情况下，推荐的在另一个项目中解析插件的方法是在项目 settings 文件的 pluginManagement {} 块中添加 resolutionStrategy 部分，如下所示。

source: In this chapter we discuss how to use plugins and the terminology and concepts surrounding plugins.
zh_cn: 在本章中，我们将讨论如何使用插件以及与插件相关的术语和概念。

source: In this example, GreetingPluginExtension is an object with a property called message.
zh_cn: 在本例中，GreetingPluginExtension 是一个具有名为 message 的属性的对象。

source: In this example, several settings can be grouped together within the configure<GreetingPluginExtension> block.
zh_cn: 在本例中，可以在 configure<GreetingPluginExtension> 块中将多个设置组合在一起。

source: In this example, several settings can be grouped together within the greeting closure.
zh_cn: 在本例中，可以在 greeting 闭包中将多个设置组合在一起。

source: In this example, we configure the greet task destination property as a closure/provider, which is evaluated with the Project.file(java.lang.Object) method to turn the return value of the closure/provider into a File object at the last minute.
zh_cn: 在本例中，我们将 greet 任务的 destination 属性配置为闭包/提供者，并使用 Project.file(java.lang.Object) 方法，在最后一刻将闭包/提供程序的返回值转换为 File 对象。

source: In this sample, myproject.library-conventions plugin uses a custom task class from buildSrc/src/main/java to configure library README checks:
zh_cn: 在此示例中，myproject.library-conventions 插件使用来自 buildSrc/src/main/java 的自定义任务类来配置库的 README 检查：

source: In this sample, convention plugins are implemented as precompiled script plugins - this is the simplest way to start out as you can use one of Gradle’s DSLs directly to implement the build logic, just as if the plugin was a regular build script.
zh_cn: 在这个示例中，约定插件被实现为 预编译脚本插件 - 这是最简单的开始方式，因为你可以直接使用 Gradle 的 DSL 来实现构建逻辑，就像插件是一个常规构建脚本。

source: In this way, using an extension object extends the Gradle DSL to add a project property and DSL block for the plugin.
zh_cn: 通过这种方式，使用扩展对象 extends (扩展)Gradle DSL，为插件添加项目属性和 DSL 块。

source: In turn, these filesystem changes may prevent Gradle’s build cache from properly identifying and caching what would otherwise be cacheable tasks.
zh_cn: 反过来，这些文件系统更改可能会阻止 Gradle 的 构建缓存 正确识别和缓存原本可以缓存的任务。

source: Including the plugin from an external jar defined as a buildscript dependency (see Applying plugins using the buildscript block).
zh_cn: 从定义为 buildscript dependency 的外部 jar 的引入插件(请参阅 Applying plugins using the buildscript block)。

source: Including the plugin from the plugin portal or a custom repository using the plugins DSL (see Applying plugins using the plugins DSL).
zh_cn: 使用 plugins DSL，从 plugin portal 或自定义仓库引入插件(请参见 Applying plugins using the plugins DSL)。

source: Inspecting Gradle Builds
zh_cn: 检查 Gradle 构建

source: Installing Gradle
zh_cn: 安装 Gradle

source: Intermingling or overwriting output files produced by different tasks compromises up-to-date checking causing slower builds.
zh_cn: 混合或覆盖由不同任务生成的输出文件会影响 up-to-date 检查，从而导致生成速度变慢。

source: Introduction
zh_cn: 介绍

source: It also provides direct access to the Gradle API.
zh_cn: 它还提供了对 Gradle API 的直接访问。

source: It also requires that the definition of plugins to use be somewhat static.
zh_cn: 它还要求使用的插件的定义是静态的。

source: It applies java-library and maven-publish plugins as well as the myproject.java-conventions plugin.
zh_cn: 它应用了 java-library 和 maven-publish 插件以及 myproject.java-conventions 插件。

source: It applies the core java and checkstyle plugins as well as an external com.github.spotbugs plugin, configures common compiler options as well as code quality checks.
zh_cn: 它应用了核心 java 和 checkstyle 插件以及外部 com.github.spotbugs 插件，配置常见的编译器选项以及代码质量检查。

source: It can do things such as:
zh_cn: 它可以做以下事情：

source: It can then be applied in the precompiled script plugin.
zh_cn: 然后可以将其应用到预编译脚本插件中。

source: It cannot be nested inside another construct (e.g. an if-statement or for-loop).
zh_cn: 它不能嵌套在另一个结构内(例如 if 语句或 for 循环)。

source: It cannot be used in script plugins or init scripts.
zh_cn: 它不能用于脚本插件或 init 脚本。

source: It defines the directory src/main/java as the default source directory for compilation.
zh_cn: 它将目录 src/main/java 定义为编译的默认源目录。

source: It is also applied in the subprojects of the root project:
zh_cn: 它也适用于根项目的子项目：

source: It is constrained, in order to be idempotent (produce the same result every time) and side effect free (safe for Gradle to execute at any time).
zh_cn: 它受到限制，以便幂等(每次产生相同的结果)和无副作用(Gradle 可以在任何时候安全地执行)。

source: It is documented here in case a build author cannot use the plugins DSL due to restrictions in how it currently works.
zh_cn: 如果构建作者由于当前工作方式的限制而无法使用 plugins DSL，本文将对此进行说明。

source: It is very convenient to use buildSrc for that purpose as long as the code does not need to be shared among multiple, independent projects.
zh_cn: 如果代码不需要在多个独立的项目之间共享，则可以非常方便地使用 buildSrc 来实现该目的。

source: It works with the Gradle plugin portal to provide easy access to both core and community plugins.
zh_cn: 它与 Gradle plugin portal 配合使用，提供对核心插件和社区插件的轻松访问。

source: It’s a good location for placing properties that control the build environment.
zh_cn: 控制构建环境的属性最好就放在该文件中。

source: It’s common to declare properties on the command line for ad-hoc scenarios.
zh_cn: 对于特殊场景，在命令行上声明属性是很常见的。

source: It’s very common that a project defines and executes different types of tests e.g. unit tests, integration tests, functional tests or smoke tests.
zh_cn: 一个项目通常会定义并执行不同类型的测试，例如单元测试、集成测试、功能测试或冒烟测试。

source: Ivy Publish Plugin
zh_cn: Ivy 发布插件

source: JVM Plugins
zh_cn: JVM 插件

source: Java Application Plugin
zh_cn: Java 应用插件

source: Java Library Plugin
zh_cn: Java 库插件

source: Java Platform Plugin
zh_cn: Java 平台插件

source: Java source files live in src/main/java, whereas Kotlin source files live in src/main/kotlin.
zh_cn: Java 源文件位于 src/main/java 中，而 Kotlin 源文件位于 src/main/kotlin 中。

source: Kotlin DSL precompiled script plugins built with Gradle 6.0 cannot be used with earlier versions of Gradle.
zh_cn: 使用 Gradle 6.0 构建的 Kotlin DSL 预编译脚本插件不能用于 Gradle 的早期版本。

source: Learning Basic Concepts
zh_cn: 学习基本概念

source: Learning More About Build Scripts
zh_cn: 了解有关构建脚本的更多信息

source: Learning the Basics
zh_cn: 学习基础知识

source: Legacy Plugin Application
zh_cn: 旧版插件应用

source: Let’s add a simple extension object to the project.
zh_cn: 让我们向项目添加一个简单的扩展对象。

source: Let’s say that all our projects will be Java projects.
zh_cn: 假设我们所有的项目都是 Java 项目。

source: Let’s take the Java plugin as an example.
zh_cn: 让我们以 Java plugin 为例。

source: Let’s use the following project structure:
zh_cn: 让我们使用以下项目结构：

source: Likewise, src/main/groovy/my.java-library-convention.gradle would result in a plugin ID of my.java-library-convention.
zh_cn: 同样，src/main/groovy/my.java-library-convention.gradle 将产生 my.java-library-convention 的插件 ID。

source: Likewise, src/main/kotlin/my/java-library-convention.gradle.kts would result in a plugin ID of my.java-library-convention as long as it has a package declaration of my.
zh_cn: 同样地，如果它有一个包声明 my，则 src/main/kotlin/my/java-library-convention.gradle.kts 将产生 my.java-library-convention 的插件 ID。

source: Limitations of the plugins DSL
zh_cn: plugins DSL 的限制

source: Locations of binary plugins
zh_cn: 二进制插件的位置

source: Locking Versions
zh_cn: 锁定版本

source: Logging sensitive information (e.g. credentials, tokens, certain environment variables) is considered a security vulnerability.
zh_cn: 记录敏感信息(例如凭据，令牌，某些环境变量)被 视为安全漏洞。

source: Making the plugin configurable
zh_cn: 使插件可配置

source: Managing Dependencies
zh_cn: 管理依赖

source: Mapping extension properties to task properties
zh_cn: 将扩展属性映射到任务属性

source: Maven Publish Plugin
zh_cn: Maven 发布插件

source: May contain any alphanumeric character, '.', and '-'.
zh_cn: 可以包含任何字母数字字符，“.”和“-”。

source: Migrating to Gradle
zh_cn: 迁移到 Gradle

source: Modeling Feature Variants and Optional Dependencies
zh_cn: 建模功能变体和可选依赖

source: More details
zh_cn: 更多细节

source: More on plugins
zh_cn: 更多关于插件

source: Most plugins offer some configuration options for build scripts and other plugins to use to customize how the plugin works.
zh_cn: 大多数插件为构建脚本和其他插件提供一些配置选项，用于自定义插件的工作方式。

source: Multiple script plugins (of either form) can be applied to a given target.
zh_cn: 可以将多个脚本插件(任意一种形式)应用于给定的目标。

source: Must contain at least one '.' character separating the namespace from the name of the plugin.
zh_cn: 必须至少包含一个“.”字符，以将名称空间与插件名称分隔。

source: Next, create a new java-library-convention.gradle.kts file in the buildSrc/src/main/kotlin directory and set its contents to the following:
zh_cn: 接下来，在 buildSrc/src/main/kotlin 目录中创建一个新的 java-library-convention.gradle.kts 文件，并将其内容设置为以下内容：

source: Next, create a new java-library-convention.gradle file in the buildSrc/src/main/groovy directory and set its contents to the following:
zh_cn: 接下来，在 buildSrc/src/main/groovy 目录中创建一个新的 java-library-convention.gradle 文件，并将其内容设置为以下内容：

source: No other statements are allowed; their presence will cause a compilation error.
zh_cn: 不允许有其他语句；如果有将导致编译错误。

source: Note for plugins published without java-gradle-plugin
zh_cn: 没有使用 java-gradle-plugin 的插件注意事项

source: Note how applying a convention plugin to a subproject effectively declares its type.
zh_cn: 注意将约定插件应用于子项目如何有效地声明其类型。

source: Note that this will actually apply the plugins to the main project, i.e. the one that applies the precompiled script plugin.
zh_cn: 请注意，这实际上会将插件应用于主项目，即应用预编译脚本插件的项目。

source: Notice that the properties filename matches the plugin id and is placed in the resources folder, and that the implementation-class property identifies the Plugin implementation class.
zh_cn: 请注意，properties 文件名与插件 id 匹配，并放在 resources 文件夹中，implementation-class 属性标识了 Plugin 实现类。

source: Now we will move our plugin to a standalone project so that we can publish it and share it with others.
zh_cn: 现在我们将把我们的插件转移到一个独立的项目中，这样我们就可以发布它并与其他人共享。

source: Often enterprises want to standardize the build platform for all projects in the organization by defining common conventions or rules.
zh_cn: 通常，企业常常通过定义通用的约定或规则来规范组织中所有项目的构建平台。

source: Often the cross-configuration section will do if subproject is of type X, then configure Y.
zh_cn: 通常跨项目配置部分将执行 if subproject is of type X, then configure Y。

source: Oftentimes, you have several related properties you need to specify on a single plugin.
zh_cn: 通常，你需要在一个插件上指定几个相关属性。

source: Once a plugin is resolved, its API can be used in a build script.
zh_cn: 一旦插件被解析，它的 API 就可以在构建脚本中使用。

source: Once the dependency is added, the external plugin can be applied in precompiled script plugin by id:
zh_cn: 添加依赖项后，可以通过 id 在预编译脚本插件中应用外部插件：

source: One benefit of setting plugin versions this way is that the pluginManagement.plugins {} does not have the same constrained syntax as the build script plugins {} block.
zh_cn: 以这种方式设置插件版本的一个好处是 pluginManagement.plugins {}，没有和构建脚本 plugins {} 块相同的 constrained syntax。

source: One thing to note is that a new instance of a plugin is created for each project it is applied to.
zh_cn: 需要注意的一点是，对于每个应用插件的项目都会创建一个新的插件实例。

source: Optimally, the test source code for each test type should be stored in dedicated source directories.
zh_cn: 最佳情况下，每种测试类型的测试源代码都应该存储在专用的源目录中。

source: Optimize the loading and reuse of plugin classes.
zh_cn: 优化插件类的加载和重用。

source: Optimizing Build Times
zh_cn: 优化构建时间

source: Optionally, the buildSrc directory can host a build script if additional configuration is needed (e.g. to apply plugins or to declare dependencies).
zh_cn: 或者，如果需要额外配置(例如应用插件或声明依赖项)，则 buildSrc 目录可以添加构建脚本。

source: Or in other words, a subproject’s type tells us what traits the project has.
zh_cn: 或者换句话说，子项目的 类型 告诉我们项目具有的特征。

source: Or some combination of the two.
zh_cn: 或两者的一些组合。

source: Organize and publish build logic for reuse in other projects
zh_cn: 组织并发布构建逻辑，以便在其他项目中重用

source: Organize build logic into reusable pieces
zh_cn: 将构建逻辑组织成可重用的部分

source: Organize your build logic into a Gradle plugin written in Java.
zh_cn: 将构建逻辑组织到用 Java 编写的 Gradle 插件中。

source: Organizing Build Logic
zh_cn: 组织构建逻辑

source: Organizing build logic
zh_cn: 组织构建逻辑

source: Other Developing Gradle Topics
zh_cn: 其他开发中的 Gradle 主题

source: Other language plugins follow the same pattern.
zh_cn: 其他的语言插件也遵循相同的模式。

source: Packaging a plugin
zh_cn: 打包插件

source: Please refer to the corresponding section on how to make your plugin available on this site.
zh_cn: 请参阅相应的 段落，了解如何在本网站上提供你的插件。

source: Please see Developing Custom Gradle Task Types for more details.
zh_cn: 有关详细信息，请参阅 Developing Custom Gradle Task Types。

source: Please see Developing Custom Gradle Types for more details.
zh_cn: 有关详细信息，请参阅 Developing Custom Gradle Types。

source: Plugin Management
zh_cn: 插件管理

source: Plugin Marker Artifacts
zh_cn: 插件标记库

source: Plugin Resolution Rules
zh_cn: 插件解析规则

source: Plugin Version Management
zh_cn: 插件版本管理

source: Plugin ids are fully qualified in a manner similar to Java packages (i.e. a reverse domain name).
zh_cn: 插件 id 以类似于 Java 包(即反向域名)的方式完全限定。

source: Plugin ids should conform to the following:
zh_cn: 插件 id 应符合以下要求：

source: Plugin resolution rules allow you to modify plugin requests made in plugins {} blocks, e.g. changing the requested version or explicitly specifying the implementation artifact coordinates.
zh_cn: 插件解析规则允许你修改在 plugins {} 块中发出的插件请求，例如更改请求的版本或明确指定实现库坐标。

source: Plugins add new tasks (e.g. JavaCompile), domain objects (e.g. SourceSet), conventions (e.g. Java source is located at src/main/java) as well as extending core objects and objects from other plugins.
zh_cn: 插件会添加新任务(例如 JavaCompile)、域对象(例如 SourceSet)、约定(例如 Java 源码位于 src/main/java)以及扩展核心对象及来自其他插件对象。

source: Plugins can be applied using a plugin id.
zh_cn: 可以使用 插件 id 应用插件。

source: Plugins can then be applied by id to any build script via the plugins {} block.
zh_cn: 然后可以通过 id 将插件通过 plugins {} 块应用于任何构建脚本。

source: Plugins do this using extension objects.
zh_cn: 插件使用 extension objects (扩展对象) 来实现这一点。

source: Plugins often also provide custom task types.
zh_cn: 插件通常还提供自定义任务类型。

source: Precompiled script plugin names have two important limitations:
zh_cn: 预编译脚本插件名称有两个重要限制：

source: Precompiled script plugins
zh_cn: 预编译脚本插件

source: Precompiled script plugins are compiled into class files and packaged into a jar.
zh_cn: 预编译脚本插件被编译成类文件并打包到 jar 中。

source: Precompiled script plugins can apply other precompiled script plugins.
zh_cn: 预编译脚本插件可以应用其他预编译脚本插件。

source: Precompiled script plugins can use classes defined in the main source set of the plugins project.
zh_cn: 预编译脚本插件可以使用插件项目的主源码集中定义的类。

source: Preventing accidental upgrades
zh_cn: 防止意外升级

source: Producing and Consuming Variants of Libraries
zh_cn: 生产和消费库的变体

source: Promotes reuse and reduces the overhead of maintaining similar logic across multiple projects
zh_cn: 促进重用并减少跨多个项目维护类似逻辑的开销

source: Properties in a build script can easily become a maintenance headache and convolute the build script logic.
zh_cn: 构建脚本中的属性很容易成为维护难题，并使构建脚本逻辑复杂化。

source: Provide editors detailed information about the potential properties and values in the buildscript for editing assistance.
zh_cn: 为编辑者提供有关 buildscript 中潜在属性和值的详细信息，以获得编辑帮助。

source: Publishing Libraries
zh_cn: 发布库

source: Publishing Plugins
zh_cn: 发布插件
